Masmiseim36/nxpSDK/boards/twrk80f150m/demo_apps/ecompass_peripheral/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_LPUART1RXSRC_LPUART_RX 0x00u /*!<@brief LPUART1 receive data source select: LPUART1_RX pin */
#define SOPT5_LPUART1TXSRC_LPUART_TX 0x00u /*!<@brief LPUART1 transmit data source select: LPUART1_TX pin */

/*! @name PORTC3 (coord B8), J6[2]/LPUART1_RX/CLKOUT
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_RX_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                       /* @} */

/*! @name PORTC4 (coord A8), J8[2]/J13[A69]/U2[22]/LPUART1_TX/FBa_AD11/SDRAM_A19
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_TX_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD8 (coord A10), J13[A7]/U1[11]/U3[8]/U26[4]/I2C0_SCL
  @{ */
#define BOARD_I2C_ACCEL_SCL_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_I2C_ACCEL_SCL_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                       /* @} */

/*! @name PORTD9 (coord A9), J13[A8]/U1[12]/U3[7]/U26[6]/I2C0_SDA
  @{ */
#define BOARD_I2C_ACCEL_SDA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_I2C_ACCEL_SDA_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

/*! @name PORTD8 (coord A10), J13[A7]/U1[11]/U3[8]/U26[4]/I2C0_SCL
  @{ */
#define BOARD_GPIO_ACCEL_SCL_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_GPIO_ACCEL_SCL_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_GPIO_ACCEL_SCL_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                        /* @} */

/*! @name PORTD9 (coord A9), J13[A8]/U1[12]/U3[7]/U26[6]/I2C0_SDA
  @{ */
#define BOARD_GPIO_ACCEL_SDA_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_GPIO_ACCEL_SDA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_GPIO_ACCEL_SDA_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_GPIO_ConfigurePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
